#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include <sys/time.h>
#include <unistd.h>
#include <pthread.h>
#include <math.h>
#include <signal.h>
#include <termios.h>
#include <fcntl.h>

#include "ethercat.h"
#include "ethercatprint.h"

#define MAX_VELOCITY 2500 

// CiA 402 state machine commands (controlword)
#define CW_SHUTDOWN 0x0006
#define CW_SWITCHON 0x0007
#define CW_ENABLE 0x000F
#define CW_ENABLE_VOLTAGE 0x001F
#define CW_QUICKSTOP 0x0002
#define CW_DISABLEVOLTAGE 0x0000
#define CW_DISABLEOPERATION 0x0007
#define CW_FAULT_RESET 0x0080

// CiA 402 statusword bit masks
#define SW_READY_TO_SWITCH_ON_BIT (0x1 << 0)
#define SW_SWITCHED_ON_BIT (0x1 << 1)
#define SW_OPERATION_ENABLED_BIT (0x1 << 2)
#define SW_FAULT_BIT (0x1 << 3)
#define SW_VOLTAGE_ENABLED_BIT (0x1 << 4)
#define SW_QUICK_STOP_BIT (0x1 << 5)
#define SW_SWITCH_ON_DISABLED_BIT (0x1 << 6)
#define SW_TARGET_REACHED_BIT (0x1 << 10)

// Operation modes
#define OP_MODE_CSV 9 // Cyclic Synchronous Velocity mode

// RxPDO (master to slave)
#pragma pack(push, 1)          // no implicit padding
typedef struct
{
    uint16_t controlword;    // 0x6040
    int8_t   op_mode;        // 0x6060
    int16_t  target_torque;  // 0x6071
    int32_t  target_position;// 0x607A
    int32_t  target_velocity;// 0x60FF
    int16_t  torque_offset;  // 0x60B2
    int32_t  tuning_command; // 0x2701
} rxpdo_t;
#pragma pack(pop)

// TxPDO (slave to master)
#pragma pack(push, 1) 
typedef struct
{
    uint16_t statusword;     // 0x6041
    int8_t op_mode_display;  // 0x6061
    int32_t position_actual; // 0x6064
    int16_t velocity_actual; // 0x606C
    int16_t torque_actual;   // 0x6077
} txpdo_t;
#pragma pack(pop)

// Global variables
char *ifname = "eth0";
int cycletime = 4000; // Cycletime in μs (4ms = 250Hz)
volatile sig_atomic_t run = 1;
int slave_index = 1;
char IOmap[4096];
pthread_t thread1;

uint32_t si_unit_velocity = 0; // 0x60A9
uint32_t feed_numerator = 0;   // 0x6092:1
uint32_t feed_denominator = 1; // 0x6092:2

// Terminal settings for keyboard input
struct termios orig_termios;

// Function prototypes
void signal_handler(int sig);
void print_extended_error(int slave);
bool setup_ethercat();
bool state_machine_control(uint16_t *controlword, uint16_t statusword, int target_state);
void *cyclic_task(void *arg);
void read_drive_parameters();
void cleanup_and_exit();
bool read_error_details(bool print_details);
bool perform_fault_reset(rxpdo_t *rxpdo, txpdo_t *txpdo);
void enable_raw_mode();
void disable_raw_mode();
int kbhit();
char readch();

// Setup terminal for raw input mode
void enable_raw_mode()
{
